#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

module.test.module.gke.random_string.cluster_service_account_suffix: Refreshing state... [id=jfhr]
module.test.module.gke.random_shuffle.available_zones: Refreshing state... [id=-]
module.test.module.gke.google_project_iam_member.cluster_service_account-monitoring_viewer[0]: Refreshing state... [id=cq-provider-gcp/roles/monitoring.viewer/serviceAccount:tf-gke-cq-example-gke--jfhr@cq-provider-gcp.iam.gserviceaccount.com]
module.test.module.gke.google_compute_firewall.master_webhooks[0]: Refreshing state... [id=projects/cq-provider-gcp/global/firewalls/gke-cq-example-gke-cluster-webhooks]
module.test.module.gcp-network.module.subnets.google_compute_subnetwork.subnetwork["us-east1/cq-example-gke-cluster-master-subnet"]: Refreshing state... [id=projects/cq-provider-gcp/regions/us-east1/subnetworks/cq-example-gke-cluster-master-subnet]
module.test.module.gke.google_project_iam_member.cluster_service_account-resourceMetadata-writer[0]: Refreshing state... [id=cq-provider-gcp/roles/stackdriver.resourceMetadata.writer/serviceAccount:tf-gke-cq-example-gke--jfhr@cq-provider-gcp.iam.gserviceaccount.com]
module.test.module.gke.google_compute_firewall.intra_egress[0]: Refreshing state... [id=projects/cq-provider-gcp/global/firewalls/gke-cq-example-gke-cluster-intra-cluster-egress]
module.test.module.gke.google_project_iam_member.cluster_service_account-log_writer[0]: Refreshing state... [id=cq-provider-gcp/roles/logging.logWriter/serviceAccount:tf-gke-cq-example-gke--jfhr@cq-provider-gcp.iam.gserviceaccount.com]
module.test.module.gcp-network.module.vpc.google_compute_network.network: Refreshing state... [id=projects/cq-provider-gcp/global/networks/cq-example-gke-cluster-network]
module.test.google_service_account.example: Refreshing state... [id=projects/cq-provider-gcp/serviceAccounts/cq-example-gke-service-account@cq-provider-gcp.iam.gserviceaccount.com]
module.test.module.gcp-network.module.subnets.google_compute_subnetwork.subnetwork["us-east1/cq-example-gke-cluster-subnet"]: Refreshing state... [id=projects/cq-provider-gcp/regions/us-east1/subnetworks/cq-example-gke-cluster-subnet]
module.test.module.gke.google_service_account.cluster_service_account[0]: Refreshing state... [id=projects/cq-provider-gcp/serviceAccounts/tf-gke-cq-example-gke--jfhr@cq-provider-gcp.iam.gserviceaccount.com]
module.test.module.gke.google_project_iam_member.cluster_service_account-metric_writer[0]: Refreshing state... [id=cq-provider-gcp/roles/monitoring.metricWriter/serviceAccount:tf-gke-cq-example-gke--jfhr@cq-provider-gcp.iam.gserviceaccount.com]
module.test.module.gke.google_container_cluster.primary: Refreshing state... [id=projects/cq-provider-gcp/locations/us-east1/clusters/cq-example-gke-cluster]
module.test.module.gke.google_container_node_pool.pools["default-node-pool"]: Refreshing state... [id=projects/cq-provider-gcp/locations/us-east1/clusters/cq-example-gke-cluster/nodePools/default-node-pool]
module.test.module.gke.google_container_node_pool.pools["cq-example-gke-pool-1"]: Refreshing state... [id=projects/cq-provider-gcp/locations/us-east1/clusters/cq-example-gke-cluster/nodePools/cq-example-gke-pool-1]
module.test.data.google_compute_zones.available: Reading...
module.test.data.google_compute_zones.available: Read complete after 0s [id=projects/cq-provider-gcp/regions/us-east1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.test.google_compute_backend_service.another-backend-service will be created
  + resource "google_compute_backend_service" "another-backend-service" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + fingerprint                     = (known after apply)
      + id                              = (known after apply)
      + load_balancing_scheme           = "EXTERNAL"
      + name                            = "cq-another-backend-service"
      + port_name                       = (known after apply)
      + project                         = (known after apply)
      + protocol                        = "SSL"
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = (known after apply)

      + cdn_policy {
          + cache_mode                   = (known after apply)
          + client_ttl                   = (known after apply)
          + default_ttl                  = (known after apply)
          + max_ttl                      = (known after apply)
          + negative_caching             = (known after apply)
          + serve_while_stale            = (known after apply)
          + signed_url_cache_max_age_sec = (known after apply)

          + cache_key_policy {
              + include_host           = (known after apply)
              + include_protocol       = (known after apply)
              + include_query_string   = (known after apply)
              + query_string_blacklist = (known after apply)
              + query_string_whitelist = (known after apply)
            }

          + negative_caching_policy {
              + code = (known after apply)
              + ttl  = (known after apply)
            }
        }

      + log_config {
          + enable      = (known after apply)
          + sample_rate = (known after apply)
        }
    }

  # module.test.google_compute_backend_service.backend-service will be created
  + resource "google_compute_backend_service" "backend-service" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + fingerprint                     = (known after apply)
      + health_checks                   = (known after apply)
      + id                              = (known after apply)
      + load_balancing_scheme           = "EXTERNAL"
      + name                            = "cq-backend-service"
      + port_name                       = (known after apply)
      + project                         = (known after apply)
      + protocol                        = "HTTPS"
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = (known after apply)

      + cdn_policy {
          + cache_mode                   = (known after apply)
          + client_ttl                   = (known after apply)
          + default_ttl                  = (known after apply)
          + max_ttl                      = (known after apply)
          + negative_caching             = (known after apply)
          + serve_while_stale            = (known after apply)
          + signed_url_cache_max_age_sec = (known after apply)

          + cache_key_policy {
              + include_host           = (known after apply)
              + include_protocol       = (known after apply)
              + include_query_string   = (known after apply)
              + query_string_blacklist = (known after apply)
              + query_string_whitelist = (known after apply)
            }

          + negative_caching_policy {
              + code = (known after apply)
              + ttl  = (known after apply)
            }
        }

      + log_config {
          + enable      = (known after apply)
          + sample_rate = (known after apply)
        }
    }

  # module.test.google_compute_backend_service.internal-backend-service will be created
  + resource "google_compute_backend_service" "internal-backend-service" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + fingerprint                     = (known after apply)
      + id                              = (known after apply)
      + load_balancing_scheme           = "INTERNAL_SELF_MANAGED"
      + name                            = "cq-internal-backend-service"
      + port_name                       = (known after apply)
      + project                         = (known after apply)
      + protocol                        = "HTTP"
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = (known after apply)

      + cdn_policy {
          + cache_mode                   = (known after apply)
          + client_ttl                   = (known after apply)
          + default_ttl                  = (known after apply)
          + max_ttl                      = (known after apply)
          + negative_caching             = (known after apply)
          + serve_while_stale            = (known after apply)
          + signed_url_cache_max_age_sec = (known after apply)

          + cache_key_policy {
              + include_host           = (known after apply)
              + include_protocol       = (known after apply)
              + include_query_string   = (known after apply)
              + query_string_blacklist = (known after apply)
              + query_string_whitelist = (known after apply)
            }

          + negative_caching_policy {
              + code = (known after apply)
              + ttl  = (known after apply)
            }
        }

      + log_config {
          + enable      = (known after apply)
          + sample_rate = (known after apply)
        }
    }

  # module.test.google_compute_https_health_check.backend-service-health-check will be created
  + resource "google_compute_https_health_check" "backend-service-health-check" {
      + check_interval_sec  = 60
      + creation_timestamp  = (known after apply)
      + healthy_threshold   = 2
      + id                  = (known after apply)
      + name                = "cq-health-check"
      + port                = 443
      + project             = (known after apply)
      + request_path        = "/"
      + self_link           = (known after apply)
      + timeout_sec         = 1
      + unhealthy_threshold = 2
    }

  # module.test.google_compute_instance.default will be created
  + resource "google_compute_instance" "default" {
      + can_ip_forward       = false
      + cpu_platform         = (known after apply)
      + current_status       = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "e2-micro"
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "cq-compute"
      + project              = "cq-provider-gcp"
      + self_link            = (known after apply)
      + tags                 = [
          + "health-check",
          + "ssh",
        ]
      + tags_fingerprint     = (known after apply)
      + zone                 = "us-east1-b"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "debian-cloud/debian-9"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      + network_interface {
          + ipv6_access_type   = (known after apply)
          + name               = (known after apply)
          + network            = "default"
          + network_ip         = (known after apply)
          + stack_type         = (known after apply)
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = false
          + on_host_maintenance = (known after apply)
          + preemptible         = true
        }
    }

  # module.test.google_compute_instance_group.test will be created
  + resource "google_compute_instance_group" "test" {
      + description = "Integration test instance group"
      + id          = (known after apply)
      + instances   = (known after apply)
      + name        = "cq-instance-group"
      + network     = (known after apply)
      + project     = (known after apply)
      + self_link   = (known after apply)
      + size        = (known after apply)
      + zone        = "us-east1-b"
    }

  # module.test.google_compute_managed_ssl_certificate.gcp_compute_managed_ssl_certificates_cert will be created
  + resource "google_compute_managed_ssl_certificate" "gcp_compute_managed_ssl_certificates_cert" {
      + certificate_id            = (known after apply)
      + creation_timestamp        = (known after apply)
      + expire_time               = (known after apply)
      + id                        = (known after apply)
      + name                      = "cq-managed-cert"
      + project                   = (known after apply)
      + self_link                 = (known after apply)
      + subject_alternative_names = (known after apply)
      + type                      = "MANAGED"

      + managed {
          + domains = [
              + "cloudquery.dev",
              + "ex.cloudquery.dev",
            ]
        }
    }

  # module.test.google_compute_router.vpn_router will be created
  + resource "google_compute_router" "vpn_router" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "cq-us-east1-compute-vpn-router"
      + network            = "cq-compute-vpc"
      + project            = "cq-provider-gcp"
      + region             = "us-east1"
      + self_link          = (known after apply)

      + bgp {
          + advertise_mode     = "DEFAULT"
          + asn                = 64519
          + keepalive_interval = 20
        }
    }

  # module.test.google_compute_ssl_policy.ssl-policy will be created
  + resource "google_compute_ssl_policy" "ssl-policy" {
      + creation_timestamp = (known after apply)
      + enabled_features   = (known after apply)
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + min_tls_version    = "TLS_1_0"
      + name               = "cq-ssl-policy"
      + profile            = "MODERN"
      + project            = (known after apply)
      + self_link          = (known after apply)
    }

  # module.test.google_compute_target_http_proxy.gcp_compute_target_http_proxies will be created
  + resource "google_compute_target_http_proxy" "gcp_compute_target_http_proxies" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "cq-target-http-proxy"
      + project            = (known after apply)
      + proxy_bind         = (known after apply)
      + proxy_id           = (known after apply)
      + self_link          = (known after apply)
      + url_map            = (known after apply)
    }

  # module.test.google_compute_target_https_proxy.gcp_compute_target_https_proxies will be created
  + resource "google_compute_target_https_proxy" "gcp_compute_target_https_proxies" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "cq-target-https-proxy"
      + project            = (known after apply)
      + proxy_bind         = (known after apply)
      + proxy_id           = (known after apply)
      + quic_override      = "NONE"
      + self_link          = (known after apply)
      + ssl_certificates   = []
      + ssl_policy         = (known after apply)
      + url_map            = (known after apply)
    }

  # module.test.google_compute_target_ssl_proxy.gcp_compute_target_ssl_proxies_proxy will be created
  + resource "google_compute_target_ssl_proxy" "gcp_compute_target_ssl_proxies_proxy" {
      + backend_service    = (known after apply)
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "cq-target-ssl-proxy"
      + project            = (known after apply)
      + proxy_header       = "NONE"
      + proxy_id           = (known after apply)
      + self_link          = (known after apply)
      + ssl_certificates   = (known after apply)
    }

  # module.test.google_compute_url_map.external_url_map will be created
  + resource "google_compute_url_map" "external_url_map" {
      + creation_timestamp = (known after apply)
      + default_service    = (known after apply)
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + map_id             = (known after apply)
      + name               = "cq-external-urlmap"
      + project            = (known after apply)
      + self_link          = (known after apply)

      + host_rule {
          + hosts        = [
              + "ex.cloudquery.dev",
            ]
          + path_matcher = "external-1"
        }

      + path_matcher {
          + default_service = (known after apply)
          + name            = "external-1"

          + path_rule {
              + paths   = [
                  + "/home",
                ]
              + service = (known after apply)
            }
        }
    }

  # module.test.google_compute_url_map.url_map will be created
  + resource "google_compute_url_map" "url_map" {
      + creation_timestamp = (known after apply)
      + default_service    = (known after apply)
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + map_id             = (known after apply)
      + name               = "cq-urlmap"
      + project            = (known after apply)
      + self_link          = (known after apply)

      + host_rule {
          + hosts        = [
              + "beta.cloudquery.dev",
            ]
          + path_matcher = "secondary"
        }
      + host_rule {
          + hosts        = [
              + "cloudquery.dev",
            ]
          + path_matcher = "root"
        }

      + path_matcher {
          + default_service = (known after apply)
          + name            = "root"

          + path_rule {
              + paths = [
                  + "/home",
                ]

              + route_action {

                  + weighted_backend_services {
                      + backend_service = (known after apply)
                      + weight          = 400

                      + header_action {
                          + request_headers_to_remove  = [
                              + "RequestHeaderToRemove",
                            ]
                          + response_headers_to_remove = [
                              + "ResponseHeaderToRemove",
                            ]

                          + request_headers_to_add {
                              + header_name  = "RequestHeaderToAdd"
                              + header_value = "RequestHeaderToAddValue"
                              + replace      = true
                            }

                          + response_headers_to_add {
                              + header_name  = "ResponseHeaderToAdd"
                              + header_value = "ResponseHeaderToAddValue"
                              + replace      = false
                            }
                        }
                    }
                }
            }
          + path_rule {
              + paths   = [
                  + "/login",
                ]
              + service = (known after apply)
            }
          + path_rule {
              + paths   = [
                  + "/static",
                ]
              + service = (known after apply)
            }
        }
      + path_matcher {
          + default_service = (known after apply)
          + name            = "secondary"
        }

      + test {
          + host    = "beta.cloudquery.dev"
          + path    = "/healthcheck"
          + service = (known after apply)
        }
    }

  # module.test.google_service_account.example will be destroyed
  # (because google_service_account.example is not in configuration)
  - resource "google_service_account" "example" {
      - account_id   = "cq-example-gke-service-account" -> null
      - disabled     = false -> null
      - display_name = "cq-example-gke-service-account" -> null
      - email        = "cq-example-gke-service-account@cq-provider-gcp.iam.gserviceaccount.com" -> null
      - id           = "projects/cq-provider-gcp/serviceAccounts/cq-example-gke-service-account@cq-provider-gcp.iam.gserviceaccount.com" -> null
      - name         = "projects/cq-provider-gcp/serviceAccounts/cq-example-gke-service-account@cq-provider-gcp.iam.gserviceaccount.com" -> null
      - project      = "cq-provider-gcp" -> null
      - unique_id    = "113321831009477095090" -> null
    }

  # module.test.module.gke.google_compute_firewall.intra_egress[0] will be destroyed
  # (because google_compute_firewall.intra_egress is not in configuration)
  - resource "google_compute_firewall" "intra_egress" {
      - creation_timestamp      = "2022-05-23T00:55:48.054-07:00" -> null
      - description             = "Managed by terraform gke module: Allow pods to communicate with each other and the master" -> null
      - destination_ranges      = [
          - "10.0.0.0/17",
          - "192.168.0.0/18",
          - "34.148.19.39/32",
        ] -> null
      - direction               = "EGRESS" -> null
      - disabled                = false -> null
      - id                      = "projects/cq-provider-gcp/global/firewalls/gke-cq-example-gke-cluster-intra-cluster-egress" -> null
      - name                    = "gke-cq-example-gke-cluster-intra-cluster-egress" -> null
      - network                 = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/networks/cq-example-gke-cluster-network" -> null
      - priority                = 1000 -> null
      - project                 = "cq-provider-gcp" -> null
      - self_link               = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/firewalls/gke-cq-example-gke-cluster-intra-cluster-egress" -> null
      - source_ranges           = [] -> null
      - source_service_accounts = [] -> null
      - source_tags             = [] -> null
      - target_service_accounts = [] -> null
      - target_tags             = [
          - "gke-cq-example-gke-cluster",
        ] -> null

      - allow {
          - ports    = [] -> null
          - protocol = "ah" -> null
        }
      - allow {
          - ports    = [] -> null
          - protocol = "esp" -> null
        }
      - allow {
          - ports    = [] -> null
          - protocol = "icmp" -> null
        }
      - allow {
          - ports    = [] -> null
          - protocol = "sctp" -> null
        }
      - allow {
          - ports    = [] -> null
          - protocol = "tcp" -> null
        }
      - allow {
          - ports    = [] -> null
          - protocol = "udp" -> null
        }
    }

  # module.test.module.gke.google_compute_firewall.master_webhooks[0] will be destroyed
  # (because google_compute_firewall.master_webhooks is not in configuration)
  - resource "google_compute_firewall" "master_webhooks" {
      - creation_timestamp      = "2022-05-23T00:55:48.052-07:00" -> null
      - description             = "Managed by terraform gke module: Allow master to hit pods for admission controllers/webhooks" -> null
      - destination_ranges      = [] -> null
      - direction               = "INGRESS" -> null
      - disabled                = false -> null
      - id                      = "projects/cq-provider-gcp/global/firewalls/gke-cq-example-gke-cluster-webhooks" -> null
      - name                    = "gke-cq-example-gke-cluster-webhooks" -> null
      - network                 = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/networks/cq-example-gke-cluster-network" -> null
      - priority                = 1000 -> null
      - project                 = "cq-provider-gcp" -> null
      - self_link               = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/firewalls/gke-cq-example-gke-cluster-webhooks" -> null
      - source_ranges           = [
          - "34.148.19.39/32",
        ] -> null
      - source_service_accounts = [] -> null
      - source_tags             = [] -> null
      - target_service_accounts = [] -> null
      - target_tags             = [
          - "gke-cq-example-gke-cluster",
        ] -> null

      - allow {
          - ports    = [
              - "9443",
              - "15017",
            ] -> null
          - protocol = "tcp" -> null
        }
    }

  # module.test.module.gke.google_container_cluster.primary will be destroyed
  # (because google_container_cluster.primary is not in configuration)
  - resource "google_container_cluster" "primary" {
      - cluster_ipv4_cidr           = "192.168.0.0/18" -> null
      - default_max_pods_per_node   = 110 -> null
      - enable_autopilot            = false -> null
      - enable_binary_authorization = false -> null
      - enable_intranode_visibility = false -> null
      - enable_kubernetes_alpha     = false -> null
      - enable_legacy_abac          = false -> null
      - enable_shielded_nodes       = true -> null
      - enable_tpu                  = false -> null
      - endpoint                    = "34.148.19.39" -> null
      - id                          = "projects/cq-provider-gcp/locations/us-east1/clusters/cq-example-gke-cluster" -> null
      - initial_node_count          = 0 -> null
      - label_fingerprint           = "a9dc16a7" -> null
      - location                    = "us-east1" -> null
      - logging_service             = "logging.googleapis.com/kubernetes" -> null
      - master_version              = "1.23.6-gke.1500" -> null
      - min_master_version          = "1.23.6-gke.1500" -> null
      - monitoring_service          = "monitoring.googleapis.com/kubernetes" -> null
      - name                        = "cq-example-gke-cluster" -> null
      - network                     = "projects/cq-provider-gcp/global/networks/cq-example-gke-cluster-network" -> null
      - networking_mode             = "VPC_NATIVE" -> null
      - node_locations              = [
          - "us-east1-c",
        ] -> null
      - node_version                = "1.23.6-gke.1500" -> null
      - project                     = "cq-provider-gcp" -> null
      - remove_default_node_pool    = false -> null
      - resource_labels             = {} -> null
      - self_link                   = "https://container.googleapis.com/v1/projects/cq-provider-gcp/locations/us-east1/clusters/cq-example-gke-cluster" -> null
      - services_ipv4_cidr          = "192.168.64.0/18" -> null
      - subnetwork                  = "projects/cq-provider-gcp/regions/us-east1/subnetworks/cq-example-gke-cluster-subnet" -> null

      - addons_config {

          - gcp_filestore_csi_driver_config {
              - enabled = false -> null
            }

          - horizontal_pod_autoscaling {
              - disabled = false -> null
            }

          - http_load_balancing {
              - disabled = true -> null
            }

          - network_policy_config {
              - disabled = true -> null
            }
        }

      - cluster_autoscaling {
          - enabled = false -> null
        }

      - database_encryption {
          - state = "DECRYPTED" -> null
        }

      - default_snat_status {
          - disabled = false -> null
        }

      - ip_allocation_policy {
          - cluster_ipv4_cidr_block       = "192.168.0.0/18" -> null
          - cluster_secondary_range_name  = "cq-example-gke-cluster-ip-range-pods" -> null
          - services_ipv4_cidr_block      = "192.168.64.0/18" -> null
          - services_secondary_range_name = "cq-example-gke-cluster-ip-range-svc" -> null
        }

      - logging_config {
          - enable_components = [
              - "SYSTEM_COMPONENTS",
              - "WORKLOADS",
            ] -> null
        }

      - maintenance_policy {
          - daily_maintenance_window {
              - duration   = "PT4H0M0S" -> null
              - start_time = "05:00" -> null
            }
        }

      - master_auth {
          - cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUVMRENDQXBTZ0F3SUJBZ0lRTVp5U3UybEhYcFBFWWMzSVBPeGNmakFOQmdrcWhraUc5dzBCQVFzRkFEQXYKTVMwd0t3WURWUVFERXlRNE5qRTFaVFV4T0MweU1tUTVMVFE1TVRBdFlqSm1PQzAxTVRObE5HRTJaV1l5WmpFdwpJQmNOTWpJd05USXpNRFkxTURReFdoZ1BNakExTWpBMU1UVXdOelV3TkRGYU1DOHhMVEFyQmdOVkJBTVRKRGcyCk1UVmxOVEU0TFRJeVpEa3RORGt4TUMxaU1tWTRMVFV4TTJVMFlUWmxaakptTVRDQ0FhSXdEUVlKS29aSWh2Y04KQVFFQkJRQURnZ0dQQURDQ0FZb0NnZ0dCQU1Mb2ZFdUVqV2JNaGZubHIwVDF0eHEwNC8zclk1NTZRMGhDbzNrQQpVd3Y1dGF1K1RVd2tPNUt0N0N4K2U0d2oyK3FTcU50WXdsWGNMa3hNR1hVaVNSdlFEdDgyRTFQY2FnTzVQaENLClcrVjlIS2JWU2Q1WVhKQm1XWkU5aGlNMUptcUVhaUVhemd3bFdISUxXdDJ1aEJ2YnBSSUh4aTVyRndMNnlNYXIKcnJ3UDY2d3Z5cElObEdQYm9DeW5BbHRFcjZRL3NmUE9LbFVsUzBkaUdNNlFpQ0VibXJSTFdiSG5JNXVuRlVubwpvQnN2RnQ1UjhBL0tnSWhaRVE5K1BhdnU4aHFBaHpWUGd6T1k4cjByRXNFV2M2aEVteTc2QllRbGJ1MnhseWovClR0bERrOUZUV3ZxYVZjY3ZqMDQ2MFZNWlVCZjA0c2I4MStQV0JRKzVDNGpXMkVFcklIa05BaERoYVR2MWNzSk0KWDJNNFg4cGNmWE5sMW9INitCMGwrU05jMHk1Q1YrMWpBKzhTVkR4eTdMVUFYRkppYk9BRGdjVlZlbFFtQjRwNAptOGNFcTdqU0hGbVp4YUFHZW5FM2RheTVTQ01JNCszeHRWb1BtUHUwb1M3TTRjSXNDRGdZYWM5TE5yRDJFN0RwCkt6QTVkYTVlejBwTnVzdUVJMTQrMWJyQU1RSURBUUFCbzBJd1FEQU9CZ05WSFE4QkFmOEVCQU1DQWdRd0R3WUQKVlIwVEFRSC9CQVV3QXdFQi96QWRCZ05WSFE0RUZnUVV1WGlnZ0c1ZWNZSDQ4UHQ0bFBlWVJLcXd4OTR3RFFZSgpLb1pJaHZjTkFRRUxCUUFEZ2dHQkFJQXowWTNtKy84TFdnWWt4YUZLNmRjN0RiVHEzYWdlYzdwaitHZFRBOUUyCk1KVUprdnRjMG9PbEE1eG4vYTFIYi91cnl6UWNtVDZ5ZHVGQ2ZZVVYwWHRrUXFVKzRlbTlxVzc4VkRPUGlzajcKYzNWZU9vM0lyaXZKemRmd2gzdTA0MFNHYWI5YkZWeUtBaGtSNDRocW54bUZTekFKaVUzd1ZlZEMyNTlSNnlIdwpBYnZDZTV0aDFXZTJmZkNpL0Z4MGxOSmt6Q0x2SlZIOWxZN3JrdE9FUmlxbnFBeWRqd0pUdVVheUdsVDVQQnAxClkrS0J5dGxxUmd3c085aFAzSWhCZzlscGNXNjJDQlZkQVVTRmFpNFdtYWdLM3ZpU1FDcDBnaklFRnhRMS9NaHMKTkFxeXVndTVqOWlVTHFOS1ZsTjRzNlJtYlo1WU1IdzB2c1lsU1VxWXMwemFSY3g4YTFKSHBLbkRIZ2VucGFqYQpnSGFiNDdSRzBKVGo2RklxTHdwcFFjdDRxa2ZFVkE0aTNxWTdFbUJ5cWlFcEY5RStkK3FuSWJMNFlEK29ISGRDCnFJWmNsUEZzRVNHbUF3dHNDMHRENWhPUlQxRlN3MU41Y044MUVmbWpyY2gwYTBkK2s1UGxySUlGY2dKZ0N5bDgKcHpoUi8zaTFXSDBDMEwxTlQxNS9ZQT09Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> null

          - client_certificate_config {
              - issue_client_certificate = false -> null
            }
        }

      - monitoring_config {
          - enable_components = [
              - "SYSTEM_COMPONENTS",
            ] -> null
        }

      - network_policy {
          - enabled  = false -> null
          - provider = "PROVIDER_UNSPECIFIED" -> null
        }

      - node_config {
          - disk_size_gb      = 100 -> null
          - disk_type         = "pd-standard" -> null
          - guest_accelerator = [] -> null
          - image_type        = "COS_CONTAINERD" -> null
          - labels            = {} -> null
          - local_ssd_count   = 0 -> null
          - machine_type      = "e2-micro" -> null
          - metadata          = {
              - "disable-legacy-endpoints" = "true"
            } -> null
          - oauth_scopes      = [
              - "https://www.googleapis.com/auth/logging.write",
              - "https://www.googleapis.com/auth/monitoring",
            ] -> null
          - preemptible       = false -> null
          - service_account   = "cq-example-gke-service-account@cq-provider-gcp.iam.gserviceaccount.com" -> null
          - tags              = [
              - "gke-cq-example-gke-cluster",
              - "gke-cq-example-gke-cluster-default-pool",
            ] -> null
          - taint             = [] -> null

          - gcfs_config {
              - enabled = false -> null
            }

          - shielded_instance_config {
              - enable_integrity_monitoring = true -> null
              - enable_secure_boot          = false -> null
            }

          - workload_metadata_config {
              - mode = "GKE_METADATA" -> null
            }
        }

      - node_pool {
          - initial_node_count          = 0 -> null
          - instance_group_urls         = [
              - "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/zones/us-east1-c/instanceGroupManagers/gke-cq-example-gke-clust-default-pool-2ab38324-grp",
            ] -> null
          - managed_instance_group_urls = [
              - "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/zones/us-east1-c/instanceGroups/gke-cq-example-gke-clust-default-pool-2ab38324-grp",
            ] -> null
          - max_pods_per_node           = 110 -> null
          - name                        = "default-pool" -> null
          - node_count                  = 0 -> null
          - node_locations              = [
              - "us-east1-c",
            ] -> null
          - version                     = "1.23.6-gke.1500" -> null

          - management {
              - auto_repair  = true -> null
              - auto_upgrade = true -> null
            }

          - node_config {
              - disk_size_gb      = 100 -> null
              - disk_type         = "pd-standard" -> null
              - guest_accelerator = [] -> null
              - image_type        = "COS_CONTAINERD" -> null
              - labels            = {} -> null
              - local_ssd_count   = 0 -> null
              - machine_type      = "e2-micro" -> null
              - metadata          = {
                  - "disable-legacy-endpoints" = "true"
                } -> null
              - oauth_scopes      = [
                  - "https://www.googleapis.com/auth/logging.write",
                  - "https://www.googleapis.com/auth/monitoring",
                ] -> null
              - preemptible       = false -> null
              - service_account   = "cq-example-gke-service-account@cq-provider-gcp.iam.gserviceaccount.com" -> null
              - tags              = [
                  - "gke-cq-example-gke-cluster",
                  - "gke-cq-example-gke-cluster-default-pool",
                ] -> null
              - taint             = [] -> null

              - gcfs_config {
                  - enabled = false -> null
                }

              - shielded_instance_config {
                  - enable_integrity_monitoring = true -> null
                  - enable_secure_boot          = false -> null
                }

              - workload_metadata_config {
                  - mode = "GKE_METADATA" -> null
                }
            }

          - upgrade_settings {
              - max_surge       = 1 -> null
              - max_unavailable = 0 -> null
            }
        }
      - node_pool {
          - initial_node_count          = 1 -> null
          - instance_group_urls         = [
              - "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/zones/us-east1-b/instanceGroupManagers/gke-cq-example-gke-c-default-node-poo-81f26a8c-grp",
              - "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/zones/us-east1-c/instanceGroupManagers/gke-cq-example-gke-c-default-node-poo-010529e0-grp",
            ] -> null
          - managed_instance_group_urls = [
              - "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/zones/us-east1-b/instanceGroups/gke-cq-example-gke-c-default-node-poo-81f26a8c-grp",
              - "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/zones/us-east1-c/instanceGroups/gke-cq-example-gke-c-default-node-poo-010529e0-grp",
            ] -> null
          - max_pods_per_node           = 110 -> null
          - name                        = "default-node-pool" -> null
          - node_count                  = 1 -> null
          - node_locations              = [
              - "us-east1-b",
              - "us-east1-c",
            ] -> null
          - version                     = "1.23.6-gke.1500" -> null

          - autoscaling {
              - max_node_count = 2 -> null
              - min_node_count = 1 -> null
            }

          - management {
              - auto_repair  = true -> null
              - auto_upgrade = true -> null
            }

          - node_config {
              - disk_size_gb      = 10 -> null
              - disk_type         = "pd-standard" -> null
              - guest_accelerator = [] -> null
              - image_type        = "COS_CONTAINERD" -> null
              - labels            = {
                  - "cluster_name"      = "cq-example-gke-cluster"
                  - "default-node-pool" = "true"
                  - "node_pool"         = "default-node-pool"
                } -> null
              - local_ssd_count   = 0 -> null
              - machine_type      = "e2-micro" -> null
              - metadata          = {
                  - "cluster_name"                    = "cq-example-gke-cluster"
                  - "disable-legacy-endpoints"        = "true"
                  - "node-pool-metadata-custom-value" = "my-node-pool"
                  - "node_pool"                       = "default-node-pool"
                } -> null
              - oauth_scopes      = [
                  - "https://www.googleapis.com/auth/cloud-platform",
                ] -> null
              - preemptible       = true -> null
              - service_account   = "cq-example-gke-service-account@cq-provider-gcp.iam.gserviceaccount.com" -> null
              - tags              = [
                  - "gke-cq-example-gke-cluster",
                  - "gke-cq-example-gke-cluster-default-node-pool",
                  - "default-node-pool",
                ] -> null
              - taint             = [
                  - {
                      - effect = "PREFER_NO_SCHEDULE"
                      - key    = "default-node-pool"
                      - value  = "true"
                    },
                ] -> null

              - gcfs_config {
                  - enabled = false -> null
                }

              - shielded_instance_config {
                  - enable_integrity_monitoring = true -> null
                  - enable_secure_boot          = false -> null
                }

              - workload_metadata_config {
                  - mode = "GKE_METADATA" -> null
                }
            }

          - upgrade_settings {
              - max_surge       = 1 -> null
              - max_unavailable = 0 -> null
            }
        }
      - node_pool {
          - initial_node_count          = 1 -> null
          - instance_group_urls         = [
              - "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/zones/us-east1-c/instanceGroupManagers/gke-cq-example-gke-c-cq-example-gke-p-49783fda-grp",
            ] -> null
          - managed_instance_group_urls = [
              - "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/zones/us-east1-c/instanceGroups/gke-cq-example-gke-c-cq-example-gke-p-49783fda-grp",
            ] -> null
          - max_pods_per_node           = 110 -> null
          - name                        = "cq-example-gke-pool-1" -> null
          - node_count                  = 1 -> null
          - node_locations              = [
              - "us-east1-c",
            ] -> null
          - version                     = "1.23.6-gke.1500" -> null

          - autoscaling {
              - max_node_count = 1 -> null
              - min_node_count = 1 -> null
            }

          - management {
              - auto_repair  = true -> null
              - auto_upgrade = true -> null
            }

          - node_config {
              - disk_size_gb      = 10 -> null
              - disk_type         = "pd-standard" -> null
              - guest_accelerator = [] -> null
              - image_type        = "COS_CONTAINERD" -> null
              - labels            = {
                  - "cluster_name" = "cq-example-gke-cluster"
                  - "node_pool"    = "cq-example-gke-pool-1"
                } -> null
              - local_ssd_count   = 0 -> null
              - machine_type      = "e2-micro" -> null
              - metadata          = {
                  - "cluster_name"             = "cq-example-gke-cluster"
                  - "disable-legacy-endpoints" = "true"
                  - "node_pool"                = "cq-example-gke-pool-1"
                } -> null
              - oauth_scopes      = [
                  - "https://www.googleapis.com/auth/logging.write",
                  - "https://www.googleapis.com/auth/monitoring",
                ] -> null
              - preemptible       = true -> null
              - service_account   = "cq-example-gke-service-account@cq-provider-gcp.iam.gserviceaccount.com" -> null
              - tags              = [
                  - "gke-cq-example-gke-cluster",
                  - "gke-cq-example-gke-cluster-cq-example-gke-pool-1",
                ] -> null
              - taint             = [] -> null

              - gcfs_config {
                  - enabled = false -> null
                }

              - shielded_instance_config {
                  - enable_integrity_monitoring = true -> null
                  - enable_secure_boot          = false -> null
                }

              - workload_metadata_config {
                  - mode = "GKE_METADATA" -> null
                }
            }

          - upgrade_settings {
              - max_surge       = 1 -> null
              - max_unavailable = 0 -> null
            }
        }

      - release_channel {
          - channel = "UNSPECIFIED" -> null
        }

      - timeouts {
          - create = "45m" -> null
          - delete = "45m" -> null
          - update = "45m" -> null
        }

      - vertical_pod_autoscaling {
          - enabled = false -> null
        }

      - workload_identity_config {
          - workload_pool = "cq-provider-gcp.svc.id.goog" -> null
        }
    }

  # module.test.module.gke.google_container_node_pool.pools["cq-example-gke-pool-1"] will be destroyed
  # (because google_container_node_pool.pools is not in configuration)
  - resource "google_container_node_pool" "pools" {
      - cluster                     = "cq-example-gke-cluster" -> null
      - id                          = "projects/cq-provider-gcp/locations/us-east1/clusters/cq-example-gke-cluster/nodePools/cq-example-gke-pool-1" -> null
      - initial_node_count          = 1 -> null
      - instance_group_urls         = [
          - "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/zones/us-east1-c/instanceGroupManagers/gke-cq-example-gke-c-cq-example-gke-p-49783fda-grp",
        ] -> null
      - location                    = "us-east1" -> null
      - managed_instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/zones/us-east1-c/instanceGroups/gke-cq-example-gke-c-cq-example-gke-p-49783fda-grp",
        ] -> null
      - max_pods_per_node           = 110 -> null
      - name                        = "cq-example-gke-pool-1" -> null
      - node_count                  = 1 -> null
      - node_locations              = [
          - "us-east1-c",
        ] -> null
      - project                     = "cq-provider-gcp" -> null
      - version                     = "1.23.6-gke.1500" -> null

      - autoscaling {
          - max_node_count = 1 -> null
          - min_node_count = 1 -> null
        }

      - management {
          - auto_repair  = true -> null
          - auto_upgrade = true -> null
        }

      - node_config {
          - disk_size_gb      = 10 -> null
          - disk_type         = "pd-standard" -> null
          - guest_accelerator = [] -> null
          - image_type        = "COS_CONTAINERD" -> null
          - labels            = {
              - "cluster_name" = "cq-example-gke-cluster"
              - "node_pool"    = "cq-example-gke-pool-1"
            } -> null
          - local_ssd_count   = 0 -> null
          - machine_type      = "e2-micro" -> null
          - metadata          = {
              - "cluster_name"             = "cq-example-gke-cluster"
              - "disable-legacy-endpoints" = "true"
              - "node_pool"                = "cq-example-gke-pool-1"
            } -> null
          - oauth_scopes      = [
              - "https://www.googleapis.com/auth/logging.write",
              - "https://www.googleapis.com/auth/monitoring",
            ] -> null
          - preemptible       = true -> null
          - service_account   = "cq-example-gke-service-account@cq-provider-gcp.iam.gserviceaccount.com" -> null
          - tags              = [
              - "gke-cq-example-gke-cluster",
              - "gke-cq-example-gke-cluster-cq-example-gke-pool-1",
            ] -> null
          - taint             = [] -> null

          - gcfs_config {
              - enabled = false -> null
            }

          - shielded_instance_config {
              - enable_integrity_monitoring = true -> null
              - enable_secure_boot          = false -> null
            }

          - workload_metadata_config {
              - mode = "GKE_METADATA" -> null
            }
        }

      - timeouts {
          - create = "45m" -> null
          - delete = "45m" -> null
          - update = "45m" -> null
        }

      - upgrade_settings {
          - max_surge       = 1 -> null
          - max_unavailable = 0 -> null
        }
    }

  # module.test.module.gke.google_container_node_pool.pools["default-node-pool"] will be destroyed
  # (because google_container_node_pool.pools is not in configuration)
  - resource "google_container_node_pool" "pools" {
      - cluster                     = "cq-example-gke-cluster" -> null
      - id                          = "projects/cq-provider-gcp/locations/us-east1/clusters/cq-example-gke-cluster/nodePools/default-node-pool" -> null
      - initial_node_count          = 1 -> null
      - instance_group_urls         = [
          - "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/zones/us-east1-b/instanceGroupManagers/gke-cq-example-gke-c-default-node-poo-81f26a8c-grp",
          - "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/zones/us-east1-c/instanceGroupManagers/gke-cq-example-gke-c-default-node-poo-010529e0-grp",
        ] -> null
      - location                    = "us-east1" -> null
      - managed_instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/zones/us-east1-b/instanceGroups/gke-cq-example-gke-c-default-node-poo-81f26a8c-grp",
          - "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/zones/us-east1-c/instanceGroups/gke-cq-example-gke-c-default-node-poo-010529e0-grp",
        ] -> null
      - max_pods_per_node           = 110 -> null
      - name                        = "default-node-pool" -> null
      - node_count                  = 1 -> null
      - node_locations              = [
          - "us-east1-b",
          - "us-east1-c",
        ] -> null
      - project                     = "cq-provider-gcp" -> null
      - version                     = "1.23.6-gke.1500" -> null

      - autoscaling {
          - max_node_count = 2 -> null
          - min_node_count = 1 -> null
        }

      - management {
          - auto_repair  = true -> null
          - auto_upgrade = true -> null
        }

      - node_config {
          - disk_size_gb      = 10 -> null
          - disk_type         = "pd-standard" -> null
          - guest_accelerator = [] -> null
          - image_type        = "COS_CONTAINERD" -> null
          - labels            = {
              - "cluster_name"      = "cq-example-gke-cluster"
              - "default-node-pool" = "true"
              - "node_pool"         = "default-node-pool"
            } -> null
          - local_ssd_count   = 0 -> null
          - machine_type      = "e2-micro" -> null
          - metadata          = {
              - "cluster_name"                    = "cq-example-gke-cluster"
              - "disable-legacy-endpoints"        = "true"
              - "node-pool-metadata-custom-value" = "my-node-pool"
              - "node_pool"                       = "default-node-pool"
            } -> null
          - oauth_scopes      = [
              - "https://www.googleapis.com/auth/cloud-platform",
            ] -> null
          - preemptible       = true -> null
          - service_account   = "cq-example-gke-service-account@cq-provider-gcp.iam.gserviceaccount.com" -> null
          - tags              = [
              - "gke-cq-example-gke-cluster",
              - "gke-cq-example-gke-cluster-default-node-pool",
              - "default-node-pool",
            ] -> null
          - taint             = [
              - {
                  - effect = "PREFER_NO_SCHEDULE"
                  - key    = "default-node-pool"
                  - value  = "true"
                },
            ] -> null

          - gcfs_config {
              - enabled = false -> null
            }

          - shielded_instance_config {
              - enable_integrity_monitoring = true -> null
              - enable_secure_boot          = false -> null
            }

          - workload_metadata_config {
              - mode = "GKE_METADATA" -> null
            }
        }

      - timeouts {
          - create = "45m" -> null
          - delete = "45m" -> null
          - update = "45m" -> null
        }

      - upgrade_settings {
          - max_surge       = 1 -> null
          - max_unavailable = 0 -> null
        }
    }

  # module.test.module.gke.google_project_iam_member.cluster_service_account-log_writer[0] will be destroyed
  # (because google_project_iam_member.cluster_service_account-log_writer is not in configuration)
  - resource "google_project_iam_member" "cluster_service_account-log_writer" {
      - etag    = "BwXfqRi9ve0=" -> null
      - id      = "cq-provider-gcp/roles/logging.logWriter/serviceAccount:tf-gke-cq-example-gke--jfhr@cq-provider-gcp.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:tf-gke-cq-example-gke--jfhr@cq-provider-gcp.iam.gserviceaccount.com" -> null
      - project = "cq-provider-gcp" -> null
      - role    = "roles/logging.logWriter" -> null
    }

  # module.test.module.gke.google_project_iam_member.cluster_service_account-metric_writer[0] will be destroyed
  # (because google_project_iam_member.cluster_service_account-metric_writer is not in configuration)
  - resource "google_project_iam_member" "cluster_service_account-metric_writer" {
      - etag    = "BwXfqRi9ve0=" -> null
      - id      = "cq-provider-gcp/roles/monitoring.metricWriter/serviceAccount:tf-gke-cq-example-gke--jfhr@cq-provider-gcp.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:tf-gke-cq-example-gke--jfhr@cq-provider-gcp.iam.gserviceaccount.com" -> null
      - project = "cq-provider-gcp" -> null
      - role    = "roles/monitoring.metricWriter" -> null
    }

  # module.test.module.gke.google_project_iam_member.cluster_service_account-monitoring_viewer[0] will be destroyed
  # (because google_project_iam_member.cluster_service_account-monitoring_viewer is not in configuration)
  - resource "google_project_iam_member" "cluster_service_account-monitoring_viewer" {
      - etag    = "BwXfqRi9ve0=" -> null
      - id      = "cq-provider-gcp/roles/monitoring.viewer/serviceAccount:tf-gke-cq-example-gke--jfhr@cq-provider-gcp.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:tf-gke-cq-example-gke--jfhr@cq-provider-gcp.iam.gserviceaccount.com" -> null
      - project = "cq-provider-gcp" -> null
      - role    = "roles/monitoring.viewer" -> null
    }

  # module.test.module.gke.google_project_iam_member.cluster_service_account-resourceMetadata-writer[0] will be destroyed
  # (because google_project_iam_member.cluster_service_account-resourceMetadata-writer is not in configuration)
  - resource "google_project_iam_member" "cluster_service_account-resourceMetadata-writer" {
      - etag    = "BwXfqRi9ve0=" -> null
      - id      = "cq-provider-gcp/roles/stackdriver.resourceMetadata.writer/serviceAccount:tf-gke-cq-example-gke--jfhr@cq-provider-gcp.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:tf-gke-cq-example-gke--jfhr@cq-provider-gcp.iam.gserviceaccount.com" -> null
      - project = "cq-provider-gcp" -> null
      - role    = "roles/stackdriver.resourceMetadata.writer" -> null
    }

  # module.test.module.gke.google_service_account.cluster_service_account[0] will be destroyed
  # (because google_service_account.cluster_service_account is not in configuration)
  - resource "google_service_account" "cluster_service_account" {
      - account_id   = "tf-gke-cq-example-gke--jfhr" -> null
      - disabled     = false -> null
      - display_name = "Terraform-managed service account for cluster cq-example-gke-cluster" -> null
      - email        = "tf-gke-cq-example-gke--jfhr@cq-provider-gcp.iam.gserviceaccount.com" -> null
      - id           = "projects/cq-provider-gcp/serviceAccounts/tf-gke-cq-example-gke--jfhr@cq-provider-gcp.iam.gserviceaccount.com" -> null
      - name         = "projects/cq-provider-gcp/serviceAccounts/tf-gke-cq-example-gke--jfhr@cq-provider-gcp.iam.gserviceaccount.com" -> null
      - project      = "cq-provider-gcp" -> null
      - unique_id    = "101263013058508312454" -> null
    }

  # module.test.module.gke.random_shuffle.available_zones will be destroyed
  # (because random_shuffle.available_zones is not in configuration)
  - resource "random_shuffle" "available_zones" {
      - id           = "-" -> null
      - input        = [
          - "us-east1-b",
          - "us-east1-c",
          - "us-east1-d",
        ] -> null
      - result       = [
          - "us-east1-b",
          - "us-east1-d",
          - "us-east1-c",
        ] -> null
      - result_count = 3 -> null
    }

  # module.test.module.gke.random_string.cluster_service_account_suffix will be destroyed
  # (because random_string.cluster_service_account_suffix is not in configuration)
  - resource "random_string" "cluster_service_account_suffix" {
      - id          = "jfhr" -> null
      - length      = 4 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - result      = "jfhr" -> null
      - special     = false -> null
      - upper       = false -> null
    }

  # module.test.module.vpn-manage-internal.google_compute_address.vpn_gw_ip will be created
  + resource "google_compute_address" "vpn_gw_ip" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "ip-cq-compute"
      + network_tier       = (known after apply)
      + project            = "cq-provider-gcp"
      + purpose            = (known after apply)
      + region             = "us-east1"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + users              = (known after apply)
    }

  # module.test.module.vpn-manage-internal.google_compute_forwarding_rule.vpn_esp will be created
  + resource "google_compute_forwarding_rule" "vpn_esp" {
      + creation_timestamp    = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + ip_protocol           = "ESP"
      + label_fingerprint     = (known after apply)
      + load_balancing_scheme = "EXTERNAL"
      + name                  = "cq-compute-esp"
      + network               = (known after apply)
      + network_tier          = (known after apply)
      + project               = "cq-provider-gcp"
      + region                = "us-east1"
      + self_link             = (known after apply)
      + service_name          = (known after apply)
      + subnetwork            = (known after apply)
      + target                = (known after apply)
    }

  # module.test.module.vpn-manage-internal.google_compute_forwarding_rule.vpn_udp4500 will be created
  + resource "google_compute_forwarding_rule" "vpn_udp4500" {
      + creation_timestamp    = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + ip_protocol           = "UDP"
      + label_fingerprint     = (known after apply)
      + load_balancing_scheme = "EXTERNAL"
      + name                  = "cq-compute-udp4500"
      + network               = (known after apply)
      + network_tier          = (known after apply)
      + port_range            = "4500"
      + project               = "cq-provider-gcp"
      + region                = "us-east1"
      + self_link             = (known after apply)
      + service_name          = (known after apply)
      + subnetwork            = (known after apply)
      + target                = (known after apply)
    }

  # module.test.module.vpn-manage-internal.google_compute_forwarding_rule.vpn_udp500 will be created
  + resource "google_compute_forwarding_rule" "vpn_udp500" {
      + creation_timestamp    = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + ip_protocol           = "UDP"
      + label_fingerprint     = (known after apply)
      + load_balancing_scheme = "EXTERNAL"
      + name                  = "cq-compute-udp500"
      + network               = (known after apply)
      + network_tier          = (known after apply)
      + port_range            = "500"
      + project               = "cq-provider-gcp"
      + region                = "us-east1"
      + self_link             = (known after apply)
      + service_name          = (known after apply)
      + subnetwork            = (known after apply)
      + target                = (known after apply)
    }

  # module.test.module.vpn-manage-internal.google_compute_route.route[0] will be created
  + resource "google_compute_route" "route" {
      + dest_range             = "10.10.12.0/24"
      + id                     = (known after apply)
      + name                   = "cq-compute-tunnel1-route1"
      + network                = (known after apply)
      + next_hop_instance_zone = (known after apply)
      + next_hop_ip            = (known after apply)
      + next_hop_network       = (known after apply)
      + next_hop_vpn_tunnel    = (known after apply)
      + priority               = 1000
      + project                = "cq-provider-gcp"
      + self_link              = (known after apply)
    }

  # module.test.module.vpn-manage-internal.google_compute_vpn_gateway.vpn_gateway will be created
  + resource "google_compute_vpn_gateway" "vpn_gateway" {
      + creation_timestamp = (known after apply)
      + gateway_id         = (known after apply)
      + id                 = (known after apply)
      + name               = "cq-compute"
      + network            = (known after apply)
      + project            = "cq-provider-gcp"
      + region             = "us-east1"
      + self_link          = (known after apply)
    }

  # module.test.module.vpn-manage-internal.google_compute_vpn_tunnel.tunnel-static[0] will be created
  + resource "google_compute_vpn_tunnel" "tunnel-static" {
      + creation_timestamp      = (known after apply)
      + detailed_status         = (known after apply)
      + id                      = (known after apply)
      + ike_version             = 2
      + local_traffic_selector  = [
          + "0.0.0.0/0",
        ]
      + name                    = "cq-compute-tunnel-1"
      + peer_ip                 = "1.1.1.1"
      + project                 = "cq-provider-gcp"
      + region                  = "us-east1"
      + remote_traffic_selector = [
          + "0.0.0.0/0",
        ]
      + self_link               = (known after apply)
      + shared_secret           = (sensitive value)
      + shared_secret_hash      = (known after apply)
      + target_vpn_gateway      = (known after apply)
      + tunnel_id               = (known after apply)
    }

  # module.test.module.vpn-manage-internal.random_id.ipsec_secret will be created
  + resource "random_id" "ipsec_secret" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.test.module.gcp-network.module.subnets.google_compute_subnetwork.subnetwork["us-east1/cq-example-gke-cluster-master-subnet"] will be destroyed
  # (because google_compute_subnetwork.subnetwork is not in configuration)
  - resource "google_compute_subnetwork" "subnetwork" {
      - creation_timestamp         = "2022-05-23T00:50:17.601-07:00" -> null
      - gateway_address            = "10.60.0.1" -> null
      - id                         = "projects/cq-provider-gcp/regions/us-east1/subnetworks/cq-example-gke-cluster-master-subnet" -> null
      - ip_cidr_range              = "10.60.0.0/17" -> null
      - name                       = "cq-example-gke-cluster-master-subnet" -> null
      - network                    = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/networks/cq-example-gke-cluster-network" -> null
      - private_ip_google_access   = false -> null
      - private_ipv6_google_access = "DISABLE_GOOGLE_ACCESS" -> null
      - project                    = "cq-provider-gcp" -> null
      - purpose                    = "PRIVATE" -> null
      - region                     = "us-east1" -> null
      - secondary_ip_range         = [] -> null
      - self_link                  = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/regions/us-east1/subnetworks/cq-example-gke-cluster-master-subnet" -> null
      - stack_type                 = "IPV4_ONLY" -> null
    }

  # module.test.module.gcp-network.module.subnets.google_compute_subnetwork.subnetwork["us-east1/cq-example-gke-cluster-subnet"] will be destroyed
  # (because google_compute_subnetwork.subnetwork is not in configuration)
  - resource "google_compute_subnetwork" "subnetwork" {
      - creation_timestamp         = "2022-05-23T00:50:18.076-07:00" -> null
      - gateway_address            = "10.0.0.1" -> null
      - id                         = "projects/cq-provider-gcp/regions/us-east1/subnetworks/cq-example-gke-cluster-subnet" -> null
      - ip_cidr_range              = "10.0.0.0/17" -> null
      - name                       = "cq-example-gke-cluster-subnet" -> null
      - network                    = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/networks/cq-example-gke-cluster-network" -> null
      - private_ip_google_access   = true -> null
      - private_ipv6_google_access = "DISABLE_GOOGLE_ACCESS" -> null
      - project                    = "cq-provider-gcp" -> null
      - purpose                    = "PRIVATE" -> null
      - region                     = "us-east1" -> null
      - secondary_ip_range         = [
          - {
              - ip_cidr_range = "192.168.0.0/18"
              - range_name    = "cq-example-gke-cluster-ip-range-pods"
            },
          - {
              - ip_cidr_range = "192.168.64.0/18"
              - range_name    = "cq-example-gke-cluster-ip-range-svc"
            },
        ] -> null
      - self_link                  = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/regions/us-east1/subnetworks/cq-example-gke-cluster-subnet" -> null
      - stack_type                 = "IPV4_ONLY" -> null
    }

  # module.test.module.gcp-network.module.vpc.google_compute_network.network will be destroyed
  # (because google_compute_network.network is not in configuration)
  - resource "google_compute_network" "network" {
      - auto_create_subnetworks         = false -> null
      - delete_default_routes_on_create = false -> null
      - id                              = "projects/cq-provider-gcp/global/networks/cq-example-gke-cluster-network" -> null
      - mtu                             = 0 -> null
      - name                            = "cq-example-gke-cluster-network" -> null
      - project                         = "cq-provider-gcp" -> null
      - routing_mode                    = "GLOBAL" -> null
      - self_link                       = "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/global/networks/cq-example-gke-cluster-network" -> null
    }

  # module.test.module.vpc.module.subnets.google_compute_subnetwork.subnetwork["us-east1/cq-compute-subnet-01"] will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + ip_cidr_range              = "10.10.20.0/24"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "cq-compute-subnet-01"
      + network                    = "cq-compute-vpc"
      + private_ip_google_access   = false
      + private_ipv6_google_access = (known after apply)
      + project                    = "cq-provider-gcp"
      + purpose                    = (known after apply)
      + region                     = "us-east1"
      + secondary_ip_range         = []
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

  # module.test.module.vpc.module.vpc.google_compute_network.network will be created
  + resource "google_compute_network" "network" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + description                     = "Private network for cq-provider-gcp/compute"
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + mtu                             = 0
      + name                            = "cq-compute-vpc"
      + project                         = "cq-provider-gcp"
      + routing_mode                    = "GLOBAL"
      + self_link                       = (known after apply)
    }

Plan: 24 to add, 0 to change, 16 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

```

</details>

*Pusher: @erezrokah, Action: `pull_request_target`, Working Directory: ``, Workflow: `terraform_plan`*